Revit 2027 API
PartMakerMethodToDivideVolumes.ProfileFlipAlong Property
 True if the corresponding left/upper parts profile are mirrored with respect to the center line of the hosts to be divided. False if the profile of left/upper parts are defined directly by the profile family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ProfileFlipAlong { get; set; }
Public Property ProfileFlipAlong As Boolean
	Get
	Set
public:
property bool ProfileFlipAlong {
	bool get ();
	void set (bool value);
}
member ProfileFlipAlong : bool with get, set
Property Value
Boolean
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace